app/Controllers/PostAdmin.php

    public function index()
	{
        $post = new PostModel();
        $data['posts'] = $post->findAll();
---
SELECT *
FROM `posts`

    public function preview($id)
	{
		$post = new PostModel();
		$data['post'] = $post->where('id', $id)->first();
---
SELECT *
FROM `posts`
WHERE `id` = '1'
 LIMIT 1

    public function create()
    {
        // lakukan validasi
        $validation =  \Config\Services::validation();
        $validation->setRules(['title' => 'required']);
        $isDataValid = $validation->withRequest($this->request)->run();

        // jika data valid, simpan ke database
        if($isDataValid){
            $post = new PostModel();
            $post->insert([
                "title" => $this->request->getPost('title'),
                "content" => $this->request->getPost('content'),
                "status" => $this->request->getPost('status'),
                "slug" => url_title($this->request->getPost('title'), '-', TRUE)
            ]);
---
INSERT INTO `posts` (`title`, `content`, `status`, `slug`) VALUES ('uji coba post 2', 'Lorem Ipsum is simply dummy text of the printing and typesetting industry. Lorem Ipsum has been the industry\'s standard dummy text ever since the 1500s, when an unknown printer took a galley of type and scrambled it to make a type specimen book.', 'draft', 'uji-coba-post-2')

    public function edit($id)
    {
        // ambil artikel yang akan diedit
        $post = new PostModel();
        $data['post'] = $post->where('id', $id)->first();

        // lakukan validasi data artikel
        $validation =  \Config\Services::validation();
        $validation->setRules([
            'id' => 'required',
            'title' => 'required'
        ]);
        $isDataValid = $validation->withRequest($this->request)->run();
        // jika data vlid, maka simpan ke database
        if($isDataValid){
            $post->update($id, [
                "title" => $this->request->getPost('title'),
                "content" => $this->request->getPost('content'),
                "status" => $this->request->getPost('status')
            ]);
---
SELECT *
FROM `posts`
WHERE `id` = '5'
 LIMIT 1
UPDATE `posts` SET `title` = 'uji coba post 2 update 1', `content` = 'Lorem Ipsum is simply dummy text of the printing and typesetting industry. Lorem Ipsum has been the industry\'s standard dummy text ever since the 1500s, when an unknown printer took a galley of type and scrambled it to make a type specimen book. (update)', `status` = 'published'
WHERE `posts`.`id` IN ('5')

	public function delete($id){
        $post = new PostModel();
        $post->delete($id);
---
DELETE FROM `posts`
WHERE `id` IN ('6')